# Perkenalan

Nama : Arry Pandowo
Batch 001 Full-Stack Data Science Hacktiv8 Live Code Week 2

# Import Library

In [164]:
import pandas as pd
import numpy as np
import sympy as sym
import scipy as scu
import scipy.integrate as integrate

import seluruh library yang dibutuhkan

# Data Loading

## Data 1

In [165]:
df1 = np.array([[14, 19, 2, 44, 9, 1, 3, 40, 17, 22, 1402500],
               [7, 26, 26, 24, 54, 2, 2, 4, 22, 18, 2325000],
               [37, 54, 1, 43, 46, 23, 37, 36, 18, 17, 3307000],
               [19, 19, 45, 41, 43, 21, 38, 51, 56, 37, 4077000],
               [47, 28, 50, 10, 44, 54, 3, 47, 2, 21, 3998000],
               [12, 41, 31, 25, 44, 13, 16, 9, 47, 3, 2674500],
               [20, 19, 53, 56, 34, 6, 60, 37, 35, 49, 4014000],
               [60, 44, 1, 16, 9, 24, 55, 55, 30, 10, 2754500],
               [41, 55, 50, 28, 59, 54, 40, 9, 45, 34, 5511500],
               [14, 11, 39, 2, 26, 17, 51, 19, 38, 39, 3338500]]
               )

input data sebagai matriks menggunakan np.array

## Data 2

In [166]:
df2 = pd.read_csv("Swiss_boundaries.txt")
df2

     longitude  latitude
0      9.56672  47.54045
1      9.55980  47.50209
2      9.59660  47.46944
3      9.64965  47.45861
4      9.67035  47.39069
..         ...       ...
273    9.03333  47.68833
274    9.08264  47.68541
275    9.26110  47.66284
276    9.47832  47.57585
277    9.56672  47.54045

[278 rows x 2 columns]

data di download dalam bentuk txt untuk kemudian di import sebagai dataset, data termasuk dalam jenis csv.

In [167]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278 entries, 0 to 277
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   longitude  278 non-null    float64
 1   latitude   278 non-null    float64
dtypes: float64(2)
memory usage: 4.5 KB

Tidak terdapat data Null, data dapat langsung diolah

# Mathematical Calculations

## Soal 1

In [168]:
OBE = sym.Matrix(df1)
OBE.rref()

(Matrix([
 [1, 0, 0, 0, 0, 0, 0, 0, 0, 0,  5000],
 [0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 11000],
 [0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 12500],
 [0, 0, 0, 1, 0, 0, 0, 0, 0, 0,  3500],
 [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 17000],
 [0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 26000],
 [0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 10000],
 [0, 0, 0, 0, 0, 0, 0, 1, 0, 0,  2000],
 [0, 0, 0, 0, 0, 0, 0, 0, 1, 0,  7500],
 [0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 24000]]),
 (0, 1, 2, 3, 4, 5, 6, 7, 8, 9))

hasil dari OBE sebagai berikut, penjelasan lebih lanjut terhadap kolom hasil akan dibahas didalam hasil

## Soal 2

### melihat deskripsi dari data

In [169]:
df2.describe()

        longitude    latitude
count  278.000000  278.000000
mean     8.388293   46.789161
std      1.308479    0.627381
min      5.967010   45.829440
25%      7.339238   46.251680
50%      8.572925   46.616660
75%      9.500760   47.460065
max     10.488210   47.806660

### mencari nilai tengah

In [170]:
tengah = (df.min() + df.max())/2
tengah

longitude     8.22761
latitude     46.81805
dtype: float64

didapat nilai tengah dari df2 dengan melakukan jumlahann min dan max kemudian dibagi 2, nilai tengah dibutuhkan untuk menentukan batas South dan North

### Grouping Northern latitude dan longitude

In [171]:
Ndf2 = df.loc[(df2["latitude"]>= tengah.latitude) & (df2["longitude"]>= tengah.longitude)]
Ndf2

     longitude  latitude
0      9.56672  47.54045
1      9.55980  47.50209
2      9.59660  47.46944
3      9.64965  47.45861
4      9.67035  47.39069
..         ...       ...
273    9.03333  47.68833
274    9.08264  47.68541
275    9.26110  47.66284
276    9.47832  47.57585
277    9.56672  47.54045

[82 rows x 2 columns]

Dari nilai tengah didapat Grouping Northern berdasarkan persamaan berikut

### Grouping Southern latitude dan longitude

In [172]:
Sdf2 = df.loc[(df2["latitude"]<= tengah.latitude) & (df2["longitude"]<= tengah.longitude)]
Sdf2

     longitude  latitude
121    8.14194  46.22291
122    8.15875  46.18382
123    8.14958  46.15124
124    8.00903  46.00930
125    7.97305  45.99694
..         ...       ...
182    6.12868  46.58805
183    6.26917  46.68278
184    6.35875  46.71673
185    6.43500  46.75805
186    6.45687  46.78145

[66 rows x 2 columns]

Dari nilai tengah didapat Grouping Southern berdasarkan persamaan berikut

### luas dari negara swiss

In [181]:
a=np.linspace(Ndf2['latitude']
b=np.linspace(Sdf2['latitude']

int1 = integrate.trapezoid(b, a)

SyntaxError: invalid syntax (<ipython-input-181-27526451dbc4>, line 2)

# Hasil

## Jawaban hasil pertanyaan  1

Hasil dari data tersebut adalah :
* A = 5000
* B = 11000
* C = 12500
* D = 3500
* E = 17000
* F = 26000
* G = 10000
* H = 2000
* I = 7500
* J = 24000

## Jawaban hasil pertanyaan 2